In [150]:
import numpy as np
import pandas as pd

In [151]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [152]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [153]:
FlightNumber = []
i=0
j =10035
while(i<len(df)):
    
    j=j+10
    
    FlightNumber.append(j)
    i+=1

In [154]:
df.drop(['FlightNumber'],axis=1,inplace=True)

In [155]:
df.insert(2,'FlightNumber',FlightNumber,True)

In [156]:
df

            From_To  RecentDelays  FlightNumber              Airline
0      LoNDon_paris      [23, 47]         10045               KLM(!)
1      MAdrid_miLAN            []         10055    <Air France> (12)
2  londON_StockhOlm  [24, 43, 87]         10065  (British Airways. )
3    Budapest_PaRis          [13]         10075       12. Air France
4   Brussels_londOn      [67, 32]         10085          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [157]:
a= df.iloc[:,0]

In [158]:
a

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [159]:
v = a.str.split('_')

In [160]:
v=list(v)

In [161]:
names = pd.DataFrame(v, columns =['From','To'])

In [162]:
names

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [163]:
for i in range(2):
    names.iloc[:,i]=names.iloc[:,i].str.title()

In [164]:
names

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [165]:
df.iloc[:,0]=df.iloc[:,0].str.title()

In [166]:
pd.concat([names,df],axis=1)

,From,To,From_To,RecentDelays,FlightNumber,Airline
0,London,Paris,London_Paris,"[23, 47]",10045,KLM(!)
1,Madrid,Milan,Madrid_Milan,[],10055,<Air France> (12)
2,London,Stockholm,London_Stockholm,"[24, 43, 87]",10065,(British Airways. )
3,Budapest,Paris,Budapest_Paris,[13],10075,12. Air France
4,Brussels,London,Brussels_London,"[67, 32]",10085,"""Swiss Air"""

In [167]:
df.iloc[:,0]=df.iloc[:,0].str.title()

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions

In [168]:
df.drop(columns=['From_To'],axis=True,inplace=True)

In [169]:
df

   RecentDelays  FlightNumber              Airline
0      [23, 47]         10045               KLM(!)
1            []         10055    <Air France> (12)
2  [24, 43, 87]         10065  (British Airways. )
3          [13]         10075       12. Air France
4      [67, 32]         10085          "Swiss Air"

In [170]:
df.insert(1,'From',names.iloc[:,1],True)

In [171]:
df.insert(2,'To',names.iloc[:,1],True)

In [172]:
df

   RecentDelays       From         To  FlightNumber              Airline
0      [23, 47]      Paris      Paris         10045               KLM(!)
1            []      Milan      Milan         10055    <Air France> (12)
2  [24, 43, 87]  Stockholm  Stockholm         10065  (British Airways. )
3          [13]      Paris      Paris         10075       12. Air France
4      [67, 32]     London     London         10085          "Swiss Air"

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays

In [174]:
a= list(df['RecentDelays'])

In [176]:
a=pd.DataFrame(a,columns=['delay_1','delay_2','delay_3'])

In [181]:
df.drop(['RecentDelays'],axis=1,inplace=True)

In [183]:
df = pd.concat([df,a],axis=1)

In [184]:
df

,From,To,FlightNumber,Airline,delay_1,delay_2,delay_3
0,Paris,Paris,10045,KLM(!),23.0,47.0,NaN
1,Milan,Milan,10055,<Air France> (12),NaN,NaN,NaN
2,Stockholm,Stockholm,10065,(British Airways. ),24.0,43.0,87.0
3,Paris,Paris,10075,12. Air France,13.0,NaN,NaN
4,London,London,10085,"""Swiss Air""",67.0,32.0,NaN